## Staging: app
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                  NAME                                  |
|--------|------------------------------------------------------------------------|
| update | `aws_lambda_function.vault_data_integrity_check`                       |
| add    | `aws_lambda_code_signing_config.lambda_code_signing_config`            |
|        | `aws_s3_bucket.code_signed_lambda_storage`                             |
|        | `aws_s3_bucket_object.vault_data_integrity_check_main`                 |
|        | `aws_s3_bucket_public_access_block.code_signed_lambda_storage`         |
|        | `aws_signer_signing_job.vault_data_integrity_check_lambda_signing_job` |
|        | `aws_signer_signing_profile.lambda_signing_profile`                    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_code_signing_config.lambda_code_signing_config will be created
  + resource "aws_lambda_code_signing_config" "lambda_code_signing_config" {
      + arn           = (known after apply)
      + config_id     = (known after apply)
      + id            = (known after apply)
      + last_modified = (known after apply)

      + allowed_publishers {
          + signing_profile_version_arns = (known after apply)
        }

      + policies {
          + untrusted_artifact_on_deployment = "Enforce"
        }
    }

  # aws_lambda_function.vault_data_integrity_check will be updated in-place
  ~ resource "aws_lambda_function" "vault_data_integrity_check" {
      + code_signing_config_arn        = (known after apply)
      - filename                       = "/tmp/vault_data_integrity_check_main.zip" -> null
        id                             = "VaultDataIntegrityCheck"
      ~ last_modified                  = "2023-10-30T19:34:12.690+0000" -> (known after apply)
      + s3_bucket                      = (known after apply)
      + s3_key                         = (known after apply)
        tags                           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.code_signed_lambda_storage will be created
  + resource "aws_s3_bucket" "code_signed_lambda_storage" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "forms-staging-code-signed-lambda-storage"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # aws_s3_bucket_object.vault_data_integrity_check_main will be created
  + resource "aws_s3_bucket_object" "vault_data_integrity_check_main" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "unsigned/vault_data_integrity_check_main.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/tmp/vault_data_integrity_check_main.zip"
      + source_hash            = "KQdTiJ6tNvtvH+BRFnR5uTDMK2wIdxR1DftZGIJga14="
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_public_access_block.code_signed_lambda_storage will be created
  + resource "aws_s3_bucket_public_access_block" "code_signed_lambda_storage" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_signer_signing_job.vault_data_integrity_check_lambda_signing_job will be created
  + resource "aws_signer_signing_job" "vault_data_integrity_check_lambda_signing_job" {
      + completed_at               = (known after apply)
      + created_at                 = (known after apply)
      + id                         = (known after apply)
      + ignore_signing_job_failure = true
      + job_id                     = (known after apply)
      + job_invoker                = (known after apply)
      + job_owner                  = (known after apply)
      + platform_display_name      = (known after apply)
      + platform_id                = (known after apply)
      + profile_name               = (known after apply)
      + profile_version            = (known after apply)
      + requested_by               = (known after apply)
      + revocation_record          = (known after apply)
      + signature_expires_at       = (known after apply)
      + signed_object              = (known after apply)
      + status                     = (known after apply)
      + status_reason              = (known after apply)

      + destination {
          + s3 {
              + bucket = (known after apply)
              + prefix = "signed/"
            }
        }

      + source {
          + s3 {
              + bucket  = (known after apply)
              + key     = (known after apply)
              + version = (known after apply)
            }
        }
    }

  # aws_signer_signing_profile.lambda_signing_profile will be created
  + resource "aws_signer_signing_profile" "lambda_signing_profile" {
      + arn                   = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + name_prefix           = "lambda_signing_profile_"
      + platform_display_name = (known after apply)
      + platform_id           = "AWSLambda-SHA384-ECDSA"
      + revocation_record     = (known after apply)
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = (known after apply)
      + version_arn           = (known after apply)
    }

Plan: 6 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.reliability_file_storage,
  on s3.tf line 4, in resource "aws_s3_bucket" "reliability_file_storage":
   4: resource "aws_s3_bucket" "reliability_file_storage" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 23 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_2am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_3am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_4am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_5am_every_business_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_data_integrity_check"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_bucket_object.vault_data_integrity_check_main"]
WARN - plan.json - main - Missing Common Tags: ["aws_signer_signing_profile.lambda_signing_profile"]

31 tests, 17 passed, 14 warnings, 0 failures, 0 exceptions

```

</details>
